MFCMainFrameAccess.resetFocusIfNecessary(CWnd*)
Ensure focus is properly set to a valid "focus" window (i.e. not-ribbon or dialogbar for example)
and if not, set to the provided window.
pNewFocus: Window that should get focus if currently not considered valid.